Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
char curPath[256] __attribute__ ((section (".noinit")));
char input_field[STATUS_MESSAGE_LENGTH] __attribute__ ((section (".noinit")));

enum inputMode {
	MODE_SHOW_INSTRUCTION,
	MODE_SHOW_INPUT,
	MODE_SHOW_PATH,
};

enum inputMode inputActive = MODE_SHOW_PATH;




uint8_t plus_store_status[1];

MENU_ENTRY menu_entries[NUM_MENU_ITEMS] __attribute__((section(".ccmram")));


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
enum e_status_message buildMenuFromPath( MENU_ENTRY * )__attribute__((section(".flash0"))) ;
void append_entry_to_path(MENU_ENTRY *);



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */




/*************************************************************************
 * Menu Handling
 *************************************************************************/

char *get_filename_ext(char *filename) {
	char *dot = strrchr(filename, '.');
	if(!dot || dot == filename) return "";
	return (dot + 1);
}

inline void make_menu_entry_font( MENU_ENTRY **dst, const char *name, int type, uint8_t font) {
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)->font = font;
	(*dst)++;
	num_menu_entries++;
}

void make_menu_entry( MENU_ENTRY **dst, const char *name, int type){
	make_menu_entry_font(dst, name, type, user_settings.font_style);
}


const char *keyboardUppercase[]__attribute__((section(".flash0#"))) = {
	" 1  2  3  4  5  6  7  8  9  0",
	"  Q  W  E  R  T  Y  U  I  O  P",
	"   A  S  D  F  G  H  J  K  L",
	"    Z  X  C  V  B  N  M",
	0
};

const char *keyboardLowercase[]__attribute__((section(".flash0#"))) = {
	" 1  2  3  4  5  6  7  8  9  0",
	"  q  w  e  r  t  y  u  i  o  p",
	"   a  s  d  f  g  h  j  k  l",
	"    z  x  c  v  b  n  m",
	0
};

const char *keyboardSymbols[]__attribute__((section(".flash0#"))) = {
	" " MENU_TEXT_SPACE "   ( )  { }  [ ]  < >",
	"  !  ?  .  ,  :  ;  \"  '  `",
	"   @  ^  |  \\  ~  #  $  %  &",
	"    +  -  *  /  =  _",
	0
};


enum keyboardType {
	KEYBOARD_UPPERCASE,
	KEYBOARD_LOWERCASE,
	KEYBOARD_SYMBOLS,
	KEYBOARD_NONE,
};

static const char **keyboards[]__attribute__((section(".flash0#"))) = {
	keyboardUppercase,
	keyboardLowercase,
	keyboardSymbols,
	0
};


enum keyboardType lastKb = KEYBOARD_UPPERCASE;


int compVersions ( const char * version1, const char * version2 ) {
    unsigned major1 = 0, minor1 = 0, bugfix1 = 0;
    unsigned major2 = 0, minor2 = 0, bugfix2 = 0;
    sscanf(version1, "%u.%u.%u", &major1, &minor1, &bugfix1);
    sscanf(version2, "%u.%u.%u", &major2, &minor2, &bugfix2);
    if (major1 < major2) return -1;
    if (major1 > major2) return 1;
    if (minor1 < minor2) return -1;
    if (minor1 > minor2) return 1;
    if (bugfix1 < bugfix2) return -1;
    if (bugfix1 > bugfix2) return 1;
    return 0;
}

void make_keyboardFromLine(MENU_ENTRY **dst, char *line) {

	make_menu_entry(dst, MENU_TEXT_GO_BACK, Leave_SubKeyboard_Menu);
	char item[33];
	while (*line) {
		char *entry = item;
		while (*line && *line == ' ')
			line++;
		while (*line && *line != ' ')
			*entry++ = *line++;
		*entry = 0;
		if (*item)
			make_menu_entry(dst, item, Keyboard_Char);
	}
}


void make_keyboard(MENU_ENTRY **dst, enum keyboardType selector){

	make_menu_entry(dst, MENU_TEXT_GO_BACK, Leave_Menu);

	for (const char **kbRow = keyboards[selector]; *kbRow; kbRow++)
		make_menu_entry(dst, *kbRow, Setup_Menu);

	if (selector != KEYBOARD_LOWERCASE)
		make_menu_entry(dst, MENU_TEXT_LOWERCASE, Setup_Menu);
	if (selector != KEYBOARD_UPPERCASE)
		make_menu_entry(dst, MENU_TEXT_UPPERCASE, Setup_Menu);
	if (selector != KEYBOARD_SYMBOLS)
		make_menu_entry(dst, MENU_TEXT_SYMBOLS, Setup_Menu);

	if (*input_field)
		make_menu_entry(dst, MENU_TEXT_DELETE_CHAR, Delete_Keyboard_Char);

	make_menu_entry(dst, "Enter", Menu_Action);
}

/*
MENU_ENTRY *generateAppearanceMenu(MENU_ENTRY *dst) {
	make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
	make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_FONT_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_SPACING_SETUP, Setup_Menu);
	return dst;
}*/


MENU_ENTRY* generateSetupMenu(MENU_ENTRY *dst) {
	make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
	make_menu_entry(&dst, MENU_TEXT_WIFI_SETUP, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_DISPLAY, Setup_Menu);
//	make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
//	make_menu_entry(&dst, MENU_TEXT_FONT_SETUP, Setup_Menu);
//	make_menu_entry(&dst, MENU_TEXT_SPACING_SETUP, Setup_Menu);
//	make_menu_entry(&dst, MENU_TEXT_APPEARANCE, Setup_Menu);
	make_menu_entry(&dst, MENU_TEXT_SYSTEM_INFO, Sub_Menu);

	if (flash_has_downloaded_roms())
		make_menu_entry(&dst, MENU_TEXT_DELETE_OFFLINE_ROMS, Menu_Action);
	else
		make_menu_entry(&dst, MENU_TEXT_DETECT_OFFLINE_ROMS, Menu_Action);

	return dst;
}

MENU_ENTRY* generateSystemInfo(MENU_ENTRY *dst) {
	make_menu_entry(&dst, "PlusCart Device ID", Leave_Menu);

	sprintf(input_field, "        %s", stm32_udid);
	make_menu_entry(&dst, input_field, Leave_Menu);

	make_menu_entry(&dst, "STM Firmware       "VERSION, Leave_Menu);

	sprintf(input_field, "WiFi Firmware      %s", esp8266_at_version);
	make_menu_entry(&dst, input_field, Leave_Menu);

	sprintf(input_field, "Flash Size         %s", STM32F4_FLASH_SIZE > 512U ? "1 MiB": "512 KiB");
	make_menu_entry(&dst, input_field, Leave_Menu);


	sprintf(input_field, "Flash Used         %d KiB", (user_settings.first_free_flash_sector - 4 ) * 128);
	make_menu_entry(&dst, input_field, Leave_Menu);

	*input_field = 0;
	return dst;
}

enum e_status_message generateKeyboard(
		MENU_ENTRY **dst,
		MENU_ENTRY *d,
		enum e_status_message menuStatusMessage,
		enum e_status_message new_status) {

	// Scan for any keyboard rows, and if found then generate menu for row
	for (const char ***kb = keyboards; *kb; kb++)
		for (const char **row = *kb; *row; row++)
			if (!strcmp(*row, d->entryname)) {
				make_keyboardFromLine(dst, d->entryname);
				truncate_curPath();
				return menuStatusMessage;
			}

