Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	// look for change of keyboard
	if (!strcmp(d->entryname, MENU_TEXT_LOWERCASE))
		lastKb = KEYBOARD_LOWERCASE;
	else if (!strcmp(d->entryname, MENU_TEXT_UPPERCASE))
		lastKb = KEYBOARD_UPPERCASE;
	else if (!strcmp(d->entryname, MENU_TEXT_SYMBOLS))
		lastKb = KEYBOARD_SYMBOLS;
	else {

		// initial case - use previous keyboard
		menuStatusMessage = new_status;
		strcat(curPath, "/");				// trimmed off, below
	}

	make_keyboard(dst, lastKb);
	truncate_curPath();
	return menuStatusMessage;
}


enum e_status_message buildMenuFromPath( MENU_ENTRY *d )  {
	int count = 0;
	bool loadStore = false;
	bool is_entry_row;
	uint8_t pos = 0, c;
	num_menu_entries = 0;
	enum e_status_message menuStatusMessage = none;

	char *menuFontNames[] = {
			// same ordering as font IDs
			MENU_TEXT_FONT_TJZ,
			MENU_TEXT_FONT_TRICHOTOMIC12,
			MENU_TEXT_FONT_CAPTAIN_MORGAN_SPICE,
			MENU_TEXT_FONT_GLACIER_BELLE
	};

	char *tvModes[] = {
			0,
			MENU_TEXT_TV_MODE_NTSC,		// -->1
			MENU_TEXT_TV_MODE_PAL,		// -->2
			MENU_TEXT_TV_MODE_PAL60,	// -->3
	};

	char *spacingModes[] = {
			MENU_TEXT_SPACING_DENSE,		// referenced by SPACING enum
			MENU_TEXT_SPACING_MEDIUM,
			MENU_TEXT_SPACING_SPARSE,
	};


	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];
		// and this caters for the trailing slash in the setup string (if present)
//	char *mtsap = mts + sizeof(MENU_TEXT_APPEARANCE);

	if(strstr(curPath, MENU_TEXT_SETUP) == curPath) {
		char *mts = curPath + sizeof(MENU_TEXT_SETUP);   // does a +1 because of MENU_TEXT_SETUP trailing 0

		if (!strcmp(curPath, MENU_TEXT_SETUP)){
			menuStatusMessage = STATUS_SETUP;
			dst = generateSetupMenu(dst);
			loadStore = true;
		}

//		else if (strstr(mts, MENU_TEXT_APPEARANCE) == mts) {
//			dst = generateAppearanceMenu(dst);
//			loadStore = true;
//		}

		else if (strstr(mts, URLENCODE_MENU_TEXT_SYSTEM_INFO) == mts) {
			menuStatusMessage = STATUS_SETUP_SYSTEM_INFO;
			dst = generateSystemInfo(dst);
			loadStore = true;

		}



		// WiFi Setup
		else if (strstr(mts, MENU_TEXT_WIFI_SETUP) == mts) {

			int i = sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_WIFI_SETUP) - 1;

			if ( strlen(curPath) <= i ){

				set_menu_status_msg(curPath);

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_WIFI_SELECT, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_WIFI_WPS_CONNECT, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_WIFI_MANAGER, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_ESP8266_RESTORE, Menu_Action);
				if(compVersions(esp8266_at_version, CURRENT_ESP8266_FIRMWARE) == -1)
					make_menu_entry(&dst, MENU_TEXT_ESP8266_UPDATE, Menu_Action);

			}

			else {

				mts += sizeof(MENU_TEXT_WIFI_SETUP);

				if (strstr(mts, MENU_TEXT_WIFI_SELECT) == mts) {

					i += (int) sizeof(MENU_TEXT_WIFI_SELECT);
					if (strlen(curPath) > i){

						if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
							// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" + MENU_TEXT_WIFI_SELECT + "/" SSID[33] + Password + "/Enter" + '\0'
							//curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path
							truncate_curPath();

							// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					        while( curPath[i] != 30 && i < ( SIZEOF_WIFI_SELECT_BASE_PATH + 31) ){
					            i++;
					        }
					        curPath[i] = 0;

					    	if(esp8266_wifi_connect( &curPath[SIZEOF_WIFI_SELECT_BASE_PATH  ],
					    			&curPath[SIZEOF_WIFI_SELECT_BASE_PATH + 32])){
					        	menuStatusMessage = wifi_connected;
					    	}else{
					        	menuStatusMessage = wifi_not_connected;
					    	}
							curPath[0] = '\0';
						}

						else
							menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, insert_password);

					}

					else {
						menuStatusMessage = select_wifi_network;
						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
						if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
				    		return esp_timeout;
				    	}
					}

				}
				else if (strstr(mts, MENU_TEXT_WIFI_WPS_CONNECT) == mts) {

			    	menuStatusMessage = esp8266_wps_connect() ? wifi_connected : wifi_not_connected;
					*curPath = 0;
					HAL_Delay(2000);
				}

				else if (strstr(mts, MENU_TEXT_WIFI_MANAGER) == mts) {

					menuStatusMessage = done;
					esp8266_AT_WiFiManager();
			    	*curPath = 0;
				}

				else if (strstr(mts, MENU_TEXT_ESP8266_RESTORE) == mts) {

					menuStatusMessage = esp8266_reset(true) ? done : failed;
					*curPath = 0;
				}
				else if (strstr(mts, MENU_TEXT_ESP8266_UPDATE) == mts) {
					esp8266_update();
					truncate_curPath();
					menuStatusMessage = buildMenuFromPath(d);
				}
			}
		}

		// Display

		else if (strstr(mts, MENU_TEXT_DISPLAY) == mts) {


			int i = sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_DISPLAY) - 1;
			if (strlen(curPath) <= i) {

				set_menu_status_msg(curPath);

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_FONT_SETUP, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_SPACING_SETUP, Setup_Menu);
			}

			else {

				mts += sizeof(MENU_TEXT_DISPLAY);
				if (strstr(mts, MENU_TEXT_TV_MODE_SETUP) == mts) {

					if(d->type == Menu_Action){

						uint8_t tvMode = TV_MODE_NTSC;
						while (!strstr(tvModes[tvMode], d->entryname + 1))
							tvMode++;

						set_tv_mode(tvMode);

						if(user_settings.tv_mode != tvMode){
							user_settings.tv_mode = tvMode;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else {

						menuStatusMessage = STATUS_SETUP_TV_MODE;
						set_menu_status_msg(curPath);

						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (int tv = 1; tv < sizeof tvModes / sizeof *tvModes; tv++) {
							make_menu_entry(&dst, tvModes[tv], Menu_Action);
							if (user_settings.tv_mode == tv)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}

