Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
				}

				else if (strstr(mts, MENU_TEXT_FONT_SETUP) == mts) {

					if(d->type == Menu_Action){

						uint8_t fontStyle = 0;
						while (!strstr(menuFontNames[fontStyle], d->entryname + 1))
							fontStyle++;

						if(user_settings.font_style != fontStyle){
							user_settings.font_style = fontStyle;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else{

						menuStatusMessage = STATUS_SETUP_FONT_STYLE;
						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (uint8_t font=0; font < sizeof menuFontNames / sizeof *menuFontNames; font++) {
							make_menu_entry_font(&dst, menuFontNames[font], Menu_Action, font);
							if (user_settings.font_style == font)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}

				}

				// Text line spacing
				else if (strstr(mts, MENU_TEXT_SPACING_SETUP) == mts) {

					if(d->type == Menu_Action) {

						uint8_t lineSpacing = 0;
						while (!strstr(spacingModes[lineSpacing], d->entryname + 1))
							lineSpacing++;

						if(user_settings.line_spacing != lineSpacing) {
							user_settings.line_spacing = lineSpacing;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else {

						menuStatusMessage = STATUS_SETUP_LINE_SPACING;

						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (uint8_t spacing = 0; spacing < sizeof spacingModes / sizeof *spacingModes; spacing++) {
							make_menu_entry(&dst, spacingModes[spacing], Menu_Action);
							if (user_settings.line_spacing == spacing)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}
				}



			}



		}



		else if (strstr(mts, MENU_TEXT_PLUS_CONNECT) == mts) {

			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user

				if( esp8266_PlusStore_API_connect() == false)
					return esp_timeout;

				esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
	        	esp8266_print(http_request_header);
	        	esp8266_skip_http_response_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}

	        	switch (c) {
				case '0':
	        		menuStatusMessage = plus_connect_failed;
	        		break;
				case '1':
	        		menuStatusMessage = plus_created;
	        		break;
				default:
	        		menuStatusMessage = plus_connected;
	        		break;
	        	}


	        	esp8266_PlusStore_API_end_transmission();

	        	*curPath = 0;
			}

			else{

				menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, plus_connect);
				//TODO:
//				switch (inputActive) {
//				case MODE_SHOW_INSTRUCTION:
//					menuStatusMessage = plus_connect;
//					inputActive = MODE_SHOW_INPUT;
//					break;
//				case MODE_SHOW_INPUT:
//					menuStatusMessage = keyboard_input;
//					break;
//				case MODE_SHOW_PATH:
//					break;
//				default:
//					break;
//				}

				//if (inputActive /*strlen(input_field)*/)
				//	menuStatusMessage = keyboard_input;
			}
		}

		else if (strstr(mts, MENU_TEXT_PLUS_REMOVE) == mts) {

			if( esp8266_PlusStore_API_connect() == false)
				return esp_timeout;

			esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
        	esp8266_print(http_request_header);

            esp8266_skip_http_response_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}

        	menuStatusMessage = (c == '0') ? plus_connect_failed : plus_removed;

        	esp8266_PlusStore_API_end_transmission();

        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_OFFLINE_ROM_UPDATE) == mts) {

			if( flash_download("&r=1", d->filesize , 0 , false ) != DOWNLOAD_AREA_START_ADDRESS)
				menuStatusMessage = download_failed;

			else {
				menuStatusMessage = done;
	        	*curPath = 0;
			}
		}

		else if (strstr(mts, MENU_TEXT_DELETE_OFFLINE_ROMS) == mts) {

			flash_erase_storage((uint8_t)FLASH_SECTOR_5);
			user_settings.first_free_flash_sector = (uint8_t) FLASH_SECTOR_5;
		    flash_set_eeprom_user_settings(user_settings);
		    menuStatusMessage = offline_roms_deleted;
        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_DETECT_OFFLINE_ROMS) == mts) {

			uint32_t last_address = flash_check_offline_roms_size();
			if(last_address > DOWNLOAD_AREA_START_ADDRESS + 1024){
			    user_settings.first_free_flash_sector = (uint8_t) (((last_address - ADDR_FLASH_SECTOR_5) / 0x20000 ) + 6);
			    flash_set_eeprom_user_settings(user_settings);
			    menuStatusMessage = offline_roms_detected;
			}

			else
				menuStatusMessage = no_offline_roms_detected;

    		num_menu_entries = 0;
        	*curPath = 0;
		}
/*
		else if (strstr(mts, MENU_TEXT_PRIVATE_KEY) == mts) {

			if(d->type == Menu_Action) { // if actual Entry is of type Menu_Action -> Save Private key
				menuStatusMessage = private_key_saved;
	        	*curPath = 0;
			}

			else {

				if (!strcmp(mts, MENU_TEXT_PRIVATE_KEY ))
					menuStatusMessage = private_key;		//????  what have i broken that this compare would have worked

				menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, private_key);
			}
		}
*/
		else{
			// unknown entry must be from PlusStore API, so load from store.
			loadStore = true;
		}
	}

	else if (strstr(curPath, MENU_TEXT_OFFLINE_ROMS) == curPath) {
		make_menu_entry(&dst, "..", Leave_Menu);
		flash_file_list(&curPath[sizeof(MENU_TEXT_OFFLINE_ROMS) - 1], &dst, &num_menu_entries);
	}

	else if (strstr(curPath, MENU_TEXT_SEARCH_FOR_ROM) == curPath) {

		if(d->type == Menu_Action){
			// Send search to API
			for (char* p = curPath; (p = strchr(p, ' ')); *p++ = '+');			// ' ' --> '+'
			loadStore = true;
			menuStatusMessage = STATUS_CHOOSE_ROM;
		}
		else {

			// Temporary HACK.  We want to clear the input_field on first-run
			// Use of "inputActive" does not work... :(

			if (strstr(input_field, "Search ROM"))
				*input_field = 0;

			menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, STATUS_SEARCH_DETAILS);
		}
	}

	else if (d->type == Menu_Action){

